cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "wata727/tflint"
tap "KernelPanicAUS/aliyun-cli"

# Homebrew recipes
brew "aliyun-cli"
brew "ansible"
brew "apr"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bison"
brew "boost"
brew "c-ares"
brew "chruby"
brew "coreutils"
brew "ctop"
brew "curl"
brew "dep"
brew "dependency-check"
brew "direnv"
brew "docker-machine"
brew "docker-machine-driver-xhyve"
brew "emacs"
brew "freetype"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gflags"
brew "git"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "gperftools"
brew "grip"
brew "htop"
brew "httpstat"
brew "hub"
brew "imagemagick"
brew "ipcalc"
brew "irssi"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "kops"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "leiningen"
brew "leveldb"
brew "libassuan"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgpg-error"
brew "libidn2"
brew "libpng"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "libzip"
brew "luajit"
brew "lz4"
brew "mas"
brew "mawk"
brew "mesos"
brew "msgpack"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "oniguruma"
brew "openldap"
brew "openssl"
brew "openssl@1.1"
brew "p11-kit"
brew "packer"
brew "packer-completion"
brew "pbzip2"
brew "pcre"
brew "perl"
brew "pinentry"
brew "pkg-config"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "python"
brew "python@2"
brew "readline"
brew "ripgrep"
brew "rocksdb"
brew "ruby", link: true
brew "ruby-install"
brew "rustup-init"
brew "shellcheck"
brew "snappy"
brew "sops"
brew "spdylay"
brew "sqlite"
brew "telnet"
brew "terraform"
brew "terraform_landscape"
brew "tflint"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "unibilium"
brew "unp"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "xz"
brew "yarn"

# Casks
cask "1password-cli"
cask "caffeine"
cask "docker"
cask "evernote"
cask "font-fira-code"
cask "goland"
cask "google-cloud-sdk"
cask "krisp"
cask "musixmatch"
cask "pritunl"
cask "qbserve"
cask "shiftit"
cask "slack"
cask "spotify"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"

# Mac App Store
mas "Helium", id: 1054607607
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Things3", id: 904280696
mas "WhatsApp", id: 1147396723
